InformationRegisters/ВременноеХранилище.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВременноеХранилище</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УстареваетВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВременноеХранилище/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Помещает новое значение в хранилище. Срок хранения по умолчанию 1 час.
//
// Параметры:
//   Ключ - УникальныйИдентификатор - ключ хранения данных
//   Ресурс - Произвольный - значение, которое будет помещено в хранилище.
//   ВремяЖизни - Число - время хранения
//
Процедура Добавить(Ключ, Ресурс, ВремяЖизни = 3600) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ВременноеХранилище.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Ключ = Ключ;
	МенеджерЗаписи.Ресурс = Новый ХранилищеЗначения(Ресурс);
	МенеджерЗаписи.УстареваетВ = ТекущаяУниверсальнаяДата() + ВремяЖизни;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Получает из хранилища данные по ключу хранения.
// 
// Параметры:
//   Ключ - УникальныйИдентификатор - ключ хранения данных
//
// Возвращаемое значение:
//   Ресурс - Произвольный - значение из хранилища
//
Функция Прочитать(Ключ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВременноеХранилище.Ресурс КАК Ресурс
	|ИЗ
	|	РегистрСведений.ВременноеХранилище КАК ВременноеХранилище
	|ГДЕ
	|	ВременноеХранилище.Ключ = &Ключ";
	
	Запрос.Параметры.Вставить("Ключ", Ключ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ресурс.Получить();
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Удаляет данные из хранилища по ключу хранения.
//
// Параметры:
//   Ключ - УникальныйИдентификатор - ключ хранения данных
//
Процедура Удалить(Ключ) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ВременноеХранилище.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Ключ = Ключ;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры

// Удаляет из хранилища все устаревшие данные.
//
Процедура УдалитьУстаревшиеЗаписи() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Параметры.Вставить("ТекущаяДата", ТекущаяУниверсальнаяДата());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременноеХранилище.Ключ КАК Ключ
	|ИЗ
	|	РегистрСведений.ВременноеХранилище КАК ВременноеХранилище
	|ГДЕ
	|	ВременноеХранилище.УстареваетВ <= &ТекущаяДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ключ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ВременноеХранилище.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Ключ.Установить(Выборка.Ключ);
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
